tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "pure" # zsh theme
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "reattach-to-user-namespace"
brew "awscli"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "exa"
brew "fd"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "htop"
brew "httpie"
brew "jq"
brew "less"
brew "mas"
brew "memcached"
brew "neovim"
brew "postgresql", restart_service: true
brew "redis"
brew "rsync"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "zsh"
brew "python"
brew "python3"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "thefuck"
brew "direnv"
brew "sl"
brew "yarn"
brew "gh"

cask "adoptopenjdk"
cask "1password"
cask "alacritty"
cask "handbrake"
cask "ngrok"
cask "screenflick"
cask "postico"
cask "whatsapp"
cask "the-unarchiver"
cask "vlc"
cask "docker"
cask "google-cloud-sdk"
cask "figma"
cask "spotify"
