tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "openssl"
brew "openssl@1.1" # wget dependency

brew "awscli"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "exa"
brew "fd"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "htop"
brew "httpie"
brew "jq"
brew "less"
brew "mas"
brew "memcached"
brew "neovim", args: ["HEAD"]
brew "postgresql", restart_service: true
brew "redis"
brew "rsync"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "zsh"

cask "1password"
cask "alacritty"
cask "handbrake"
cask "ngrok"
cask "screenflick"
cask "postico"
cask "whatsapp"
cask "the-unarchiver"
cask "vlc"
